app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "chanakya"]]
---
    def create
      m = params[:user][:user_id]
      n = params[:user][:email]
      @user = User.find_by(user_id: m)