app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "chanakya"]]
INSERT INTO "users" ("user_id", "email", "session_token") VALUES (?, ?, ?)  [["user_id", "chanakya"], ["email", "chanakya-kumar@uiowa.edu"], ["session_token", "EM1h29QfnLZ03Cu1xCpxdg=="]]
---
    def create
        user_params
        m = params[:user][:user_id]
        if ((User.find_by(user_id: m)) == nil)
            @user = User.create_user!(user_params)